"""
Дан массив не отсортированных целых чисел. Написать функцию, которая вернет первое с конца четное число.
При написании кода используйте принцип стека. Если массив не содержит четного числа возвращать -1
"""

def last_odd(nums: list) -> int:
	while nums:
		num = nums.pop()
		if num % 2 == 0:
			return num
	return -1
	
	
if __name__ == "__main__":
	assert last_odd([8, 9, 10, 16, 9]) == 16, last_odd([8, 9, 10, 16, 9])
	assert last_odd([8, 9, 11, 17, 9]) == 8, last_odd([8, 9, 11, 17, 9])
	assert last_odd([9, 9, 11, 13, 9]) == -1, last_odd([9, 9, 11, 13, 9])

